app/controllers/admin_controller.rb

  def index
    @student = Student.new
    @event = Event.new
    @position = Position.new
    @goodcause = Goodcause.new
    @post = Post.new
    @students = Student.all
    @events = Event.all
    @positions = Position.all
---
SELECT "students".* FROM "students"
SELECT "events".* FROM "events"
SELECT "positions".* FROM "positions"