app/controllers/events_controller.rb

  def index
    @instagram = Instagram.user_recent_media("7174789", {:count => 3})
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "date", "venu", "address", "cost", "details", "created_at", "updated_at", "image", "time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "name" = $1, "time" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "The Red Party, A Costume Ball"], ["time", ""], ["updated_at", 2016-09-09 22:49:26 UTC], ["id", 3]]