app/controllers/positions_controller.rb

  def create
    @position = Position.new(position_params)
    if @position.save
---
INSERT INTO "positions" ("title", "details", "term", "created_at", "updated_at", "location") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Science Teacher"], ["details", ""], ["term", "Term II: July-Dec 2016"], ["created_at", 2016-09-30 22:52:46 UTC], ["updated_at", 2016-09-30 22:52:46 UTC], ["location", ""]]

  def edit
    @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @position = Position.find(params[:id])
    if @position.update(position_params)
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "positions" SET "title" = $1, "details" = $2, "location" = $3, "updated_at" = $4 WHERE "positions"."id" = $5  [["title", "Physics Teacher"], ["details", ""], ["location", ""], ["updated_at", 2016-09-30 23:06:21 UTC], ["id", 1]]

  def destroy
    @position = Position.destroy(params[:id])
---
DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 1]]