app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students" ORDER BY "students"."created_at" DESC

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("name", "age", "bio", "dream", "sponsored", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Tony"], ["age", 45], ["bio", "still learning"], ["dream", "a plane"], ["sponsored", false], ["created_at", 2016-09-23 22:49:47 UTC], ["updated_at", 2016-09-23 22:49:47 UTC]]

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "students"."id" = $6

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 7]]