app/controllers/subscribers_controller.rb

  def create
    @subscriber = Subscriber.new(subscriber_params)
    if @subscriber.save
---
INSERT INTO "subscribers" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "Julia@email.com"], ["created_at", 2016-09-16 21:52:43 UTC], ["updated_at", 2016-09-16 21:52:43 UTC]]