app/controllers/volunteers_controller.rb

SELECT "volunteers".* FROM "volunteers"
---
  def index
    @volunteers = Volunteer.all